In [1]:
#DataFrame

In [46]:
import pandas as pd
import numpy as np
apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,4,7,8])

data = {"apples": apples, "oranges":oranges}
fruit_df = pd.DataFrame(data)
print(fruit_df)

   apples  oranges
0       3        3
1       2        4
2       0        7
3       1        8

In [47]:
#If Index not matches then creates problems

In [48]:
state = ['Ohio', 'Ohio', 'Ohio', 'Neveda', 'Neveda', 'Neveda']
data = {'state':state,
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
       }

state_pop_df = pd.DataFrame(data, index = ['1st', '2nd', '3rd', '4th', '5th', '6th'])

state_pop_df

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Neveda  2001  2.4
5th  Neveda  2002  2.9
6th  Neveda  2003  3.2

In [49]:
state_pop_df = pd.DataFrame(data, columns = ['year', 'state', 'pop'])
print(state_pop_df)
print("\n")

print(state_pop_df.head())#ByDefalt 5 starting values given
state_pop_df.tail()#Returns 5 last values

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9
5  2003  Neveda  3.2


   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9

   year   state  pop
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9
5  2003  Neveda  3.2

In [50]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                      index = ['one', 'two', 'three', 'four', 'five', 'six'])

frame2.head()

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Neveda  2.4  NaN
five   2002  Neveda  2.9  NaN

In [51]:
print(frame2.columns)

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [53]:
frame2["state"] #Getting data using list

one        Ohio
two        Ohio
three      Ohio
four     Neveda
five     Neveda
six      Neveda
Name: state, dtype: object

In [54]:
frame2.state #Attribute

one        Ohio
two        Ohio
three      Ohio
four     Neveda
five     Neveda
six      Neveda
Name: state, dtype: object

In [55]:
frame2['debt'] = 16.5
frame2.head()

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Neveda  2.4  16.5
five   2002  Neveda  2.9  16.5

In [56]:
ln = len(frame2) #no.of rows
ln

6

In [57]:
rng = np.arange(ln)
print(rng)
frame2['debt'] = rng
frame2

[0 1 2 3 4 5]

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Neveda  2.4     3
five   2002  Neveda  2.9     4
six    2003  Neveda  3.2     5

In [58]:
frame3 = frame2

In [61]:
val = pd.Series([-1.2,-1.5,-1.7,-1.2, -1.5, -1.7, 2.2], index = ['one', 'two', 'three', 'four', 'five' , 'six', 'seven'])
frame3['debt'] = val
frame3

       year   state  pop  debt
one    2000    Ohio  1.5  -1.2
two    2001    Ohio  1.7  -1.5
three  2002    Ohio  3.6  -1.7
four   2001  Neveda  2.4  -1.2
five   2002  Neveda  2.9  -1.5
six    2003  Neveda  3.2  -1.7

In [65]:
#reindexing
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0,3,6])
print(obj3)
print("\n")
#creating new rows using reindex
obj4 = obj3.reindex(range(9))
print(obj4)
print("\n")
#removes NaN and fills with prev values
obj5 = obj3.reindex(range(2,11), method='ffill') #ffill = forward fill
obj5

0      blue
3    purple
6    yellow
dtype: object


0      blue
1       NaN
2       NaN
3    purple
4       NaN
5       NaN
6    yellow
7       NaN
8       NaN
dtype: object

2       blue
3     purple
4     purple
5     purple
6     yellow
7     yellow
8     yellow
9     yellow
10    yellow
dtype: object

In [67]:
obj6 = obj3.reindex(range(10), method='bfill')
obj6

0      blue
1    purple
2    purple
3    purple
4    yellow
5    yellow
6    yellow
7       NaN
8       NaN
9       NaN
dtype: object

In [71]:
states = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns = ['ohio', 'texas', 'California'])

states

   ohio  texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [73]:
states = states.reindex(['a', 'b', 'c', 'd'], method = 'ffill')
states

   ohio  texas  California
a     0      1           2
s     6      7           8
c     3      4           5
d     6      7           8

In [75]:
states = states.reindex(['a', 's', 'c', 'd'], method = 'ffill')
states

   ohio  texas  California
a     0      1           2
s     6      7           8
c     3      4           5
d     6      7           8

In [78]:
states_name = ['texas', 'utah', 'California', "ohio"]
states = states.reindex(columns=states_name, method ='ffill')#We cannot use ffill for whole cols
states

   texas  utah  California  ohio
a      1   NaN           2     0
s      7   NaN           8     6
c      4   NaN           5     3
d      7   NaN           8     6

In [99]:
data_df = pd.DataFrame(np.arange(16).reshape(4,4),fapply
                      index = ['Ohio', 'Colorado', 'Utah', "New York"],
                      columns = ['one', 'two', 'three', 'four'])
print(data_df, "\n")
data_df_2 = data_df
data_df_3 = data_df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data_df = data_df.drop('two', axis=1)
data_df

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [101]:
data_df_2 = data_df_2.drop('two', axis=1, inplace = True)
print(data_df_2)

None

In [102]:
data_df_3 = data_df_3.drop('Colorado', axis=0) #Axis 0 removes rows, axis 1 removes columns.
print(data_df_3)

          one  three  four
Ohio        0      2     3
Utah        8     10    11
New York   12     14    15

In [103]:
#Accessing Data
data_df = pd.DataFrame(np.arange(16).reshape(4,4),
                      index = ['Ohio', 'Colorado', 'Utah', "New York"],
                      columns = ['one', 'two', 'three', 'four'])

df2 = data_df[['one', 'three']]
print(df2)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [104]:
print(data_df[2:])#Same like numpy

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [105]:
print(data_df["one"])#Accessing data like dictionary

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [106]:
print(data_df.one[2:])#Filter on both row and col

Utah         8
New York    12
Name: one, dtype: int32

In [107]:
#Conditional Selection
print(data_df.three[data_df['three'] > 5])

Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [108]:
print(data_df, "\n")

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
df3 = data_df["three"] > 5 #BOOLEAN Datafram
print(df3)
print(data_df[data_df['three']>5])

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool
          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
#loc and iloc
#when loc tell name, when iloc tell number
print(data_df)

print(data_df.loc[['Colorado', 'Ohio'], ['two', 'three']], "\n")
print(data_df.iloc[2, [3,0,1]])#2row, 3,0,1 is col.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
          two  three
Colorado    5      6
Ohio        1      2

four    11
one      8
two      9
Name: Utah, dtype: int32

In [116]:
print(data_df.iloc[:])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [117]:
print(data_df.iloc[:3, :3])

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10

In [118]:
print(data_df.iloc[:,:3])#[row,col]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [123]:
#Adding DataFrames
df = pd.DataFrame(np.arange(9.).reshape((3,3)),
                 columns=list('bcd'),
                 index = ['Ohio', 'Texas', 'Colorado'])

df1 = pd.DataFrame(np.arange(9.).reshape((4,3)),
                 columns=list('bde'),
                 index = ['Ohio', 'Texas', 'New york','Colorado'])

#dfadd = df + df1 Take code from FB

ValueError: cannot reshape array of size 9 into shape (4,3)

In [124]:
#take CODE FROM FBBBBBB

#Function Application and Mapping
#Lambda
#frame.apply(func)

#SORTING AND RANKING
#frame.sort_index(axis=1, ascending=False) #Default in sort_index = axis = 0, ascending = True
###Sort by values
#frame.sort_values(by='b')
###RANKING
#frame.rank(ascending=False, method = 'max')
#frame.rank(axis='columns')

In [125]:
#####Summarizing & computing Descriptive Statistics

#df.sum()
#df.mean(axis = 'columns', skipna = False)
#df['one'].unique() #gives unique values
#df['one'].value_counts() #counts total values